{
  "name": "Joseph O. Reed Jr.",
  "class": "1962",
  "inducted": "2003",
  "biography": "<p>After graduating Asbury Park High School in 1962, Joseph O. Reed, Jr. attended several educational institutions. He earned a B.A. In Psychology from Columbia College, an M.A. From Webster University in Human Relations, an M.S. From Troy State University in Counseling and Psychology. His military education involved Infantry Officers Candidate School, Armed Forces Staff College, and the JFK Center for Special Warfare. He also attended Primary Helicopter School and Instructor Pilot School.</p><p>Mr. Reed went on to become Campus Director/CEO of Columbia College in Orlando, FL., and Adjunct College Professor, General Manager and Director of Security for Sunbird Airways. He also became a professional actor of stage, film, and television, and retired from the U.S. Army as a Lt. Colonel.</p><p>Joseph Reed has been very active with community involvement. He was an Athletic Official in Central Florida, involved with the YMCA, Central Florida Officials Association (Basketball), Board of Directors - Soldiers to Scholars Program, and UNCF Co-chairman fundraiser. He is active in the Episcopal Church of St. John the Baptist where he serves as President of the Men's Club, Vestry, Finance Committee, Chairman - Building Expansion Committee, Chairman - Five Year Planning Committee.</p><p>Joseph O. Reed, Jr. Earned several honors that include a Military Bronze Star, best debut performance in \"Driving Miss Daisy,\" best performance by an actor, \"Driving Miss Daisy,\" Osceola Players award, and the Director's Trophy for Command and Contributions of TF-138 from the National Security Agency.</p><p>Mr. Reed and his wife Mary are the proud parents of three children and a niece, all college graduates.</p><p>Personal quotation; \"Real knowledge is to know the extent of one's ignorance\" - Confucius</p>",
  "image": "/v1606598785/asburyparkhighschoolhalloffame/Members/JosephOReed_t7jnoh.png"
}

 

<p>After graduating Asbury Park High School in 1962, Joseph O. Reed, Jr. attended several educational institutions. He earned a B.A. In Psychology from Columbia College, an M.A. From Webster University in Human Relations, an M.S. From Troy State University in Counseling and Psychology. His military education involved Infantry Officers Candidate School, Armed Forces Staff College, and the JFK Center for Special Warfare. He also attended Primary Helicopter School and Instructor Pilot School.</p><p>Mr. Reed went on to become Campus Director/CEO of Columbia College in Orlando, FL., and Adjunct College Professor, General Manager and Director of Security for Sunbird Airways. He also became a professional actor of stage, film, and television, and retired from the U.S. Army as a Lt. Colonel.</p><p>Joseph Reed has been very active with community involvement. He was an Athletic Official in Central Florida, involved with the YMCA, Central Florida Officials Association (Basketball), Board of Directors - Soldiers to Scholars Program, and UNCF Co-chairman fundraiser. He is active in the Episcopal Church of St. John the Baptist where he serves as President of the Men's Club, Vestry, Finance Committee, Chairman - Building Expansion Committee, Chairman - Five Year Planning Committee.</p><p>Joseph O. Reed, Jr. Earned several honors that include a Military Bronze Star, best debut performance in "Driving Miss Daisy," best performance by an actor, "Driving Miss Daisy," Osceola Players award, and the Director's Trophy for Command and Contributions of TF-138 from the National Security Agency.</p><p>Mr. Reed and his wife Mary are the proud parents of three children and a niece, all college graduates.</p><p>Personal quotation; "Real knowledge is to know the extent of one's ignorance" - Confucius</p>