[
  {
      
      "btnUrl" : "/docs/Donation.pdf",
      "btnLabel" : "Print Donation Form",
      "content" : "<p>\n          The Distinguished Hall of Fame is a 501(c)3 non-profit corporation\n          registered with the IRS and the State of New Jersey formed to\n          recognize alumni who have distinguished themselves in a variety of\n          endeavors, thus providing positive role models for current APHS\n          students. Virtually all the money we receive goes to the students. Our\n          only expenses are mailing, postage, corporate & accounting. A real\n          impact has been made by past Hall of Fame inductees who shared their\n          life stories with students, including the personal and financial\n          hardships they often had to overcome before finally reaching their\n          goals. We have, to date, given a total of $162,000 to a total of 162\n          students over the past 15 years. We firmly believe that what we have\n          done and what we continue to do has helped the resurgence of the City\n          of Asbury Park, the health of its school system and the stability of\n          the local community. Should you wish to share in the opportunity of\n          our scholarship efforts for worthy APHS students, please complete this\n          donation page and send it with your check to the address provided.\n        </p>"
  },
  {

      "btnUrl" : "/docs/2020AdvertiseCeremony.pdf",
      "btnLabel" : "Print Advertise Form",
      "content" : " <p>\n          On Thursday evening, October 14, 2021, the postponed 2020 Ceremony\n          will take place and ten more outstanding alumni of Asbury Park High\n          School will be inducted into the Distinguished Alumni Hall of Fame\n          during the ninth induction ceremony dinner to be held at the Sheraton\n          in Eatontown.\n        </p>\n        <p>\n          The Hall of Fame Committee will be publishing a commemorative journal\n          that will be distributed at the induction event. By purchasing an ad\n          in the journal, you will be honoring our Distinguished Alumni, and\n          providing additional resources that will enable the Hall of Fame\n          Committee to continue this valuable program.\n        </p>\n        <p>\n          <strong>\n            Please complete the form and submit, by September 20, 2021, with\n            your payment, to Asbury Park High School Distinguished Hall of Fame:\n            c/o Marilyn Tomaino, 102 Tanya Circle, Ocean, NJ 07712.\n          </strong>\n        </p>"
  }
]