{
	"_id": {
		"$oid": "61f5eccd79e187836a1b0a04"
	},
	"missionStatement": "      <p>\n        Welcome to the Asbury Park High School Distinguished Alumni Hall of\n        Fame. Part of our mission is to recognize and honor those APHS graduates\n        who have used the skills and knowledge which they acquired in High\n        School to become “Distinguished” adults in many different and varied\n        fields. Another and equally important portion of our mission is to\n        instill in the current APHS students a feeling that they too can be\n        successful adults irrespective of their often difficult backgrounds.\n      </p>\n      <p>\n        A part of that task is for us to install a plaque in the hallway of the\n        high school displaying a photo of the inductee together with a brief\n        description of their accomplishments so that the current students can\n        actually visualize who was inducted and why.\n      </p>",
	"history": "    <p>\n      In the late 90’s, Carl Williams, Mayor of Asbury Park and graduate of\n      Asbury Park High School, conceived of a vehicle where the rich history of\n      the high school and its graduates would be remembered and celebrated. Carl\n      also saw this as an opportunity to introduce outstanding graduates to\n      current high school students, enabling the students to observe first hand,\n      that success was indeed possible regardless of how difficult their\n      backgrounds may be.\n    </p>\n    <p>\n      Mayor Williams enlisted his friend, Judge Ira Kreizman, also an APHS\n      graduate, and together they formed a committee to make Carl’s dream a\n      reality. The initial committee consisted of Williams and Kreizman, Sandy\n      Armstead, the late Gladys Johnson, Henry Johnson, Oliver Jones, Janice\n      Davis Keener, Lorraine Hartigan Nonnenberg, and Myrna Wright, the\n      Parent/Community Coordinator at APHS. After all of the legal and\n      accounting requirements for a non-profit corporation were met, and\n      criteria for induction was determined, the first group of Hall of Famers\n      was selected. The initial group was inducted on 4/11/03 before a solid\n      crowd at the Berkeley Carteret Hotel in Asbury Park. Earlier that day,\n      many of the inductees met with students at the high school, sharing their\n      path to success.\n    </p>\n    <p>\n      Each inductee into the Asbury Park High School Distinguished Alumni Hall\n      of Fame is honored with a plaque featuring a photo and brief career\n      highlights. The plaques are mounted in the main corridor of the high\n      school where they can be viewed by present day students who will hopefully\n      be encouraged to emulated the success of prior students who came from\n      similar backgrounds and overcame similar hardships.\n    </p>\n    <p>\n      By 2005, the committee expanded to include Alan McKean, Sharon Brown,\n      Thomas DeSeno, Remo Strada and Stanley Smith. Unfortunately, one of the\n      charter members, Glady Johnson, passed away on 1/12/05. The journal was\n      dedicated to her memory recognizing her tremendous contribution to the\n      APHS Hall of Fame.\n    </p>\n    <p>\n      Nineteen alumni were inducted on 4/22/05, once again at the Berkeley\n      Carteret Hotel. Included in the group of inductees was the late Leon Hess,\n      founder of Amerada Hess and owner of the N.Y. Jets, who graduated from\n      APHS in 1931.\n    </p>\n    <p>\n      In 2007 Marilyn Higginbotham Tomaino and Rita Abbott Abrams joined the\n      committee. Fourteen new honorees were inducted into the Hall of Fame in\n      ceremonies held at Branches in West Long Branch, while the Berkeley was\n      undergoing renovations.\n    </p>\n    <p>\n      A generous contribution from the Hess Foundation and Norma Wilentz Hess,\n      widow of Leon Hess, gave the committee the ability to provide college\n      scholarships to Asbury Park High School graduates. Scholarships were\n      awarded each year from 2007.\n    </p>\n    <p>\n      Paul Chaiet joined the Hall of Fame Committee in 2009. Thirteen new\n      honorees were inducted into the Hall of Fame during the ceremonies held on\n      5/10/10, once again at the Berkeley. The induction ceremony was dedicated\n      to the memory of Norma Hess, who unfortunately passed away earlier that\n      year.\n    </p>\n    <p>In 2010, Joe Curdup joined the committee.</p>\n    <p>\n      In 2012 we inducted 13 more distinguished alumni in a ceremony highlighted\n      by the performance of gold record recording start, Lenny Welch,\n      accompanied by Grammy Award-winning composer and musician, John Colby,\n      APHS Class of ’67.\n    </p>\n    <p>\n      In 2016, we added 13 new hall of Fame members from classes going all the\n      way back to 1923, 1941 and 1943 and up until 1993.\n    </p>\n    <p>\n      Our last induction ceremony was held in 2018 at which time 12 alumni\n      joined the ranks of the Hall of Fame. Susan Skokos became part of the\n      committee in 2019.\n    </p>\n    <p class=\"h4\">\n      <strong>\n        Unfortunately, COVID 19 forced us to postpone our induction ceremony\n        from May 2020 until October 2021.\n      </strong>\n    </p>",
	"latest": " <p>\n        Welcome to the Asbury Park High School Distinguished Alumni Hall of\n        Fame. Part of our mission is to recognize and honor those APHS graduates\n        who have used the skills and knowledge which they acquired in High\n        School to become “Distinguished” adults in many different and varied\n        fields. Another and equally important portion of our mission is to\n        instill in the current APHS students a feeling that they too can be\n        successful adults irrespective of their often difficult backgrounds.\n      </p>\n      <p>\n        A part of that task is for us to install a plaque in the hallway of the\n        high school displaying a photo of the inductee together with a brief\n        description of their accomplishments so that the current students can\n        actually visualize who was inducted and why.\n      </p>"
}
